In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
sdata = [2000.0, 3000.0, 4000.0, np.nan]  # np.nan: not a number

In [4]:
city = ['서울', '부산', '울산', '목포']

In [5]:
myseries2 = pd.Series(sdata, index = city)  #sdata를 시리즈 데이터로 변환. 인덱스는 city로

In [6]:
myseries2.name = '호호호'  # 시리즈 자체의 이름

In [7]:
myseries2.index.name = '크크크'  # 인덱스 이름

In [8]:
print(myseries2)

크크크
서울    2000.0
부산    3000.0
울산    4000.0
목포       NaN
Name: 호호호, dtype: float64

In [6]:
# 시리즈 생성 방법

pd.Series(range(0, 4))

0    0
1    1
2    2
3    3
dtype: int64

In [7]:
from pandas import Series

In [8]:
myseries = Series([4, 5, 6], index = ['a', 'b', 'c'])
print(myseries)

a    4
b    5
c    6
dtype: int64

In [11]:
sdata = {'서울' : 3000, '부산' : 2000}
myseries = Series(sdata)
print(myseries)

서울    3000
부산    2000
dtype: int64

In [12]:
#시리즈의 데이터 읽기와 쓰기

In [13]:
myindex = ['서울', '부산', '광주', '대구', '울산', '목포', '여수']
mylist = [50, 60, 40, 80, 70, 30, 20]
myseries = pd.Series(data = mylist, index = myindex)

myseries

서울    50
부산    60
광주    40
대구    80
울산    70
목포    30
여수    20
dtype: int64

In [14]:
myseries[['서울']]     # 인덱스 이름으로 값 읽기

서울    50
dtype: int64

In [15]:
myseries['대구':'목포']  #라벨 이름으로 슬라이싱

대구    80
울산    70
목포    30
dtype: int64

In [16]:
myseries[[2]]  # 인덱스로 데이터 읽기

광주    40
dtype: int64

In [17]:
myseries[0:5:2]   #0 부터 4 까지 2칸씩 건너서 읽기

서울    50
광주    40
울산    70
dtype: int64

In [18]:
myseries[[1, 3, 5]]  # 1, 3, 5번째 데이터 읽기

부산    60
대구    80
목포    30
dtype: int64

In [19]:
myseries[3:6]  # 슬라이싱 사용하기

대구    80
울산    70
목포    30
dtype: int64

In [20]:
# 시리즈 내의 데이터 변경

myseries[2] = 22  
myseries[2:5] = 33  #인덱싱된 값 변경
myseries['서울', '대구'] = 55 
myseries[0::2] = 77  #짝수 행만 77로 변경

In [21]:
# 데이터프레임 시작

In [22]:
import pandas as pd
from pandas import DataFrame

In [23]:
sdata = {'city' : ['서울', '서울', '서울', '부산', '부산'],
        'year' : [2000, 2001, 2002, 2001, 2002],
        'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]}

mycolumn = ['city', 'year', 'pop']
myindex = ['one', 'two', 'three', 'four', 'five']
myframe = pd.DataFrame(sdata, columns = mycolumn, index = myindex)

print(myframe)

      city  year  pop
one     서울  2000  1.5
two     서울  2001  1.7
three   서울  2002  3.6
four    부산  2001  2.4
five    부산  2002  2.9

In [24]:
# 데이터프레임 생성

import numpy as np
import pandas as pd

In [25]:
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']
mycolumns = ['서울', '부산', '광주', '목포', '경주']
mylist = list(10 * onedata for onedata in range(1, 26))  # 1~25까지의 정수를 생성해서 각각 10을 곱함

print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [26]:
# reshape

In [28]:
myframe = pd.DataFrame(np.reshape(mylist, (5,5)), index = myindex, columns = mycolumns)
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [29]:
# iloc : 행 인덱스 번호를 기준으로 행을 추출해주는 함수

In [30]:
result = myframe.iloc[1]  # 1행 추출
result

서울     60
부산     70
광주     80
목포     90
경주    100
Name: 김유신, dtype: int32

In [31]:
result = myframe.iloc[[1, 3]]  #1, 3행 추출
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200

In [32]:
result = myframe.iloc[0::2]  # 슬라이싱을 이용해 짝수행만 추출
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [33]:
# loc : 라벨을 이용해 행을 추출

In [34]:
result = myframe.loc['이순신']   loc은 하나의 행만 추출하므로, 시리즈형태임(두개 이상은 데이터프레임 형태)
result

SyntaxError: invalid syntax (<ipython-input-34-db84ec70d09f>, line 1)

In [35]:
result = myframe.loc[['이순신']]  # 대괄호를 2개 사용하면 데이터프레임을 반환
result

     서울  부산  광주  목포  경주
이순신  10  20  30  40  50

In [36]:
result = myframe.loc[['이순신', '강감찬']]  # 콤마를 사용해 2개 이상의 데이터 반환
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150

In [37]:
myframe.index

Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object')

In [38]:
mytarget = np.random.choice(myframe.index, 3)  # 랜덤 인덱스 3개 추출
mytarget

array(['강감찬', '광해군', '이순신'], dtype=object)

In [39]:
result = myframe.loc[mytarget] # loc 속성 이용 
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
이순신   10   20   30   40   50

In [40]:
result = myframe.loc[['강감찬'], ['광주']]  # 원 하는 블럭만 뽑기
result

      광주
강감찬  130

In [41]:
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

      광주   목포
연산군  230  240
강감찬  130  140

In [42]:
result = myframe.loc['김유신':'광해군', '광주':'목포']  # 슬라이싱에서 문자열이므로 양쪽 모두 포함
result

      광주   목포
김유신   80   90
강감찬  130  140
광해군  180  190

In [45]:
result = myframe.loc['김유신':'광해군', ['부산']]   # 김유신에서 광해군까지 부산에 대한 것만
result

      부산
김유신   70
강감찬  120
광해군  170

In [47]:
# ~ 55분
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [46]:
result = myframe.loc[[False, True, True, False, True]]   # True에 해당되는 김유신, 강감찬, 연산군 행의 정보만 추출
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [48]:
result = myframe.loc[myframe['부산'] <= 100]   # 부산 값이 100 이하인 시리즈의 행의 정보만 뽑아서 result에 저장
result

     서울  부산  광주  목포   경주
이순신  10  20  30  40   50
김유신  60  70  80  90  100

In [49]:
result = myframe.loc[myframe['목포'] == 140]   # 목포의 실적이 140인 항목들을 조회.
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150

In [50]:
cond1 = myframe['부산'] >= 70      # 해당 되는 시리즈의 그 행들을 저장
cond2 = myframe['목포'] >= 140
type(cond1)

pandas.core.series.Series

In [51]:
cond1  # 부울형, 데이터타입 보기

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
Name: 부산, dtype: bool

In [52]:
cond2

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
Name: 목포, dtype: bool

In [56]:
df.all()   # and 연산과 동일

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
dtype: bool

In [57]:
df.any  # or연산과 동일

<bound method DataFrame.any of       이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True>

In [ ]:
df = pd.DataFrame([cond1, cond2])  # 두 개의 부울을 엮어서 데이터프레임 만듦
df

In [59]:
result = myframe.loc[df.all()]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [61]:
result = myframe.loc[lambda df : df['광주'] >= 130]   # 람다함수 이용! 광주의 값이 130이상인 행들을 추출
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [66]:
myframe.loc[['이순신', '강감찬'], ['부산']] = 30   # 이순신과 강감찬 행의 '부산' 값을 30으로 *변경*
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90  100
강감찬  110   30  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [71]:
myframe.loc['김유신':'광해군', ['경주']] = 80   # 김유신부터 광해군까지 행의 '경주' 값을 80로 *변경*
                                                # 행 범위에 [] 대활호 쓰지 않는다!
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   30   80   90   80
강감찬  110   30  130  140   80
광해군  160   30  180  190   80
연산군  210  220  230  240  250

In [73]:
myframe.loc[['연산군'], :] = 50  # 연산군의 모든 열을 50으로 변경
myframe

      서울  부산   광주   목포  경주
이순신   10  30   30   40  50
김유신   60  30   80   90  80
강감찬  110  30  130  140  80
광해군  160  30  180  190  80
연산군   50  50   50   50  50

In [75]:
myframe.loc[:, ['광주']] = 60  # 모든 사람의 광주 열을 60으로 변경
myframe

      서울  부산  광주   목포  경주
이순신   10  30  60   40  50
김유신   60  30  60   90  80
강감찬  110  30  60  140  80
광해군  160  30  60  190  80
연산군   50  50  60   50  50

In [77]:
myframe.loc[myframe['경주'] <= 150, ['경주', '광주']] = 0   # 경주 값이 150 이하인 행 중에서 경주과 광주 열의 값을 0으로 바꿈
myframe

      서울  부산  광주   목포  경주
이순신   10  30   0   40   0
김유신   60  30   0   90   0
강감찬  110  30   0  140   0
광해군  160  30   0  190   0
연산군   50  50   0   50   0

In [ ]:
## 30~31p

In [78]:
import pandas as pd

In [86]:
df = pd.read_csv('C:/Users/create/DV/memberInfo.csv', index_col = 'id')   # id열을 인덱스 컬럼으로 지정!!
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [88]:
type(df)

pandas.core.frame.DataFrame

In [87]:
print('시리즈와 aply 메서드')

시리즈와 aply 메서드

In [90]:
print('일반적인 산술 연산')
df['kor'] + 5

일반적인 산술 연산

id
김철수    65
홍길동    75
박영희    85
Name: kor, dtype: int64

In [ ]:
#apply 함수

In [91]:
def plus5(x):
    return x + 5

In [92]:
print('apply 함수를 적용한 결과')
sq = df['kor'].apply(plus5)   # 중요!! 함수의 인수는>>   df['kor']  , apply 안에는 함수 이름이 들어감
sq

apply 함수를 적용한 결과

id
김철수    65
홍길동    75
박영희    85
Name: kor, dtype: int64

In [97]:
def gob(x, n):
    return n * x

In [98]:
ex = df['kor'].apply(gob, n=2)   # 인수는 국어점수, 인자가 2개
ex

id
김철수    120
홍길동    140
박영희    160
Name: kor, dtype: int64

In [95]:
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [103]:
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [101]:
def applyByColumn(col):   # 함수 이름, 매개변수는 col
    mysum = 0       
    for item in col:  #행방향으로
        mysum += item
    print(mysum)
    return mysum / df.shape[0]   ## df.shape[0] : 행의 개수, df.shape[1] : 열의 개수

In [102]:
df.apply(applyByColumn, axis = 0)   # axis = 0 : 행 방향으로 수행
# 각 과목의 평균 출력

210
225

kor    70.0
eng    75.0
dtype: float64

In [104]:
def applyByRow(row):   # 함수 이름, 매개변수는 row
    mysum = 0       
    for item in row:     #열방향으로
        mysum += item
    print(mysum)
    return mysum / df.shape[1]   ## df.shape[1] : 열의 개수

In [107]:
df.apply(applyByRow, axis = 1)   # axis = 0 : 행 방향으로 수행
# 각 과목의 평균 출력

130
145
160

id
김철수    65.0
홍길동    72.5
박영희    80.0
dtype: float64